; domain
(define (domain pacman-72)
  (:requirements :strips :typing)
  (:types position)

  (:predicates
    (at ?pos - position)
    (not_at ?pos - position)          ; complement of at
    (visited ?pos - position)
    (connected ?from ?to - position)
    (hasFood ?pos - position)
    (noFood ?pos - position)          ; complement of hasFood
    (carryingFood) 
  )

  (:action move
    :parameters (?from ?to - position)
    :precondition (and
      (at ?from)
      (not_at ?to)
      (connected ?from ?to)
    )
    :effect (and
      (at ?to)
      (not (at ?from))        ; DELETE: Pacman is no longer at ?from
      (not_at ?from)
      (visited ?to)
      (not (not_at ?to))      ; DELETE: ?to is no longer marked as not_at
    )
  )

  (:action eat
    :parameters (?pos - position)
    :precondition (and
      (at ?pos)
      (hasFood ?pos)
    )
    :effect (and
      (carryingFood)
      (noFood ?pos)
      (not (hasFood ?pos))   ; DELETE: the food is gone
    )
  )
)

; problem
(define (problem pacman-72)
    (:domain pacman-72)
    (:objects
        p00 p01 p02 p03 p04 p10 p11 p12 p13 p14 p20 p21 p22 p23 p24 p30 p31 p32 p33 p34 p40 p41 p42 p43 p44 - position
    )

    (:init
        (not_at p00)
        (not (at p00))
        (not_at p01)
        (not (at p01))
        (not_at p02)
        (not (at p02))
        (not_at p03)
        (not (at p03))
        (not_at p04)
        (not (at p04))
        (not_at p10)
        (not (at p10))
        (not_at p11)
        (not (at p11))
        (not_at p12)
        (not (at p12))
        (not_at p13)
        (not (at p13))
        (not_at p14)
        (not (at p14))
        (not_at p20)
        (not (at p20))
        (not_at p21)
        (not (at p21))
        (not_at p22)
        (not (at p22))
        (not_at p23)
        (not (at p23))
        (at p24)
        (not (not_at p24))
        (not_at p30)
        (not (at p30))
        (not_at p31)
        (not (at p31))
        (not_at p32)
        (not (at p32))
        (not_at p33)
        (not (at p33))
        (not_at p34)
        (not (at p34))
        (not_at p40)
        (not (at p40))
        (not_at p41)
        (not (at p41))
        (not_at p42)
        (not (at p42))
        (not_at p43)
        (not (at p43))
        (not_at p44)
        (not (at p44))
        (noFood p00)
        (not (hasFood p00))
        (noFood p01)
        (not (hasFood p01))
        (noFood p02)
        (not (hasFood p02))
        (noFood p03)
        (not (hasFood p03))
        (noFood p04)
        (not (hasFood p04))
        (noFood p10)
        (not (hasFood p10))
        (hasFood p11)
        (not (noFood p11))
        (hasFood p12)
        (not (noFood p12))
        (noFood p13)
        (not (hasFood p13))
        (noFood p14)
        (not (hasFood p14))
        (hasFood p20)
        (not (noFood p20))
        (noFood p21)
        (not (hasFood p21))
        (hasFood p22)
        (not (noFood p22))
        (noFood p23)
        (not (hasFood p23))
        (noFood p24)
        (not (hasFood p24))
        (noFood p30)
        (not (hasFood p30))
        (noFood p31)
        (not (hasFood p31))
        (noFood p32)
        (not (hasFood p32))
        (noFood p33)
        (not (hasFood p33))
        (noFood p34)
        (not (hasFood p34))
        (noFood p40)
        (not (hasFood p40))
        (noFood p41)
        (not (hasFood p41))
        (noFood p42)
        (not (hasFood p42))
        (noFood p43)
        (not (hasFood p43))
        (noFood p44)
        (not (hasFood p44))
        (connected p00 p10)
        (connected p10 p00)
        (connected p00 p01)
        (connected p01 p00)
        (connected p01 p11)
        (connected p11 p01)
        (connected p01 p02)
        (connected p02 p01)
        (connected p02 p12)
        (connected p12 p02)
        (connected p02 p03)
        (connected p03 p02)
        (connected p03 p13)
        (connected p13 p03)
        (connected p03 p04)
        (connected p04 p03)
        (connected p04 p14)
        (connected p14 p04)
        (connected p10 p20)
        (connected p20 p10)
        (connected p10 p11)
        (connected p11 p10)
        (connected p11 p21)
        (connected p21 p11)
        (connected p11 p12)
        (connected p12 p11)
        (connected p12 p22)
        (connected p22 p12)
        (connected p12 p13)
        (connected p13 p12)
        (connected p13 p23)
        (connected p23 p13)
        (connected p13 p14)
        (connected p14 p13)
        (connected p14 p24)
        (connected p24 p14)
        (connected p20 p30)
        (connected p30 p20)
        (connected p20 p21)
        (connected p21 p20)
        (connected p21 p31)
        (connected p31 p21)
        (connected p21 p22)
        (connected p22 p21)
        (connected p22 p32)
        (connected p32 p22)
        (connected p22 p23)
        (connected p23 p22)
        (connected p23 p33)
        (connected p33 p23)
        (connected p23 p24)
        (connected p24 p23)
        (connected p24 p34)
        (connected p34 p24)
        (connected p30 p40)
        (connected p40 p30)
        (connected p30 p31)
        (connected p31 p30)
        (connected p31 p41)
        (connected p41 p31)
        (connected p31 p32)
        (connected p32 p31)
        (connected p32 p42)
        (connected p42 p32)
        (connected p32 p33)
        (connected p33 p32)
        (connected p33 p43)
        (connected p43 p33)
        (connected p33 p34)
        (connected p34 p33)
        (connected p34 p44)
        (connected p44 p34)
        (connected p40 p41)
        (connected p41 p40)
        (connected p41 p42)
        (connected p42 p41)
        (connected p42 p43)
        (connected p43 p42)
        (connected p43 p44)
        (connected p44 p43)
    )

    (:goal (and
        (noFood p12)
        (noFood p20)
        (noFood p11)
        (noFood p22)
    ))
)

; plan
1. (move p24 p23)
   deleted: (at p24) (not_at p23)
   added: (at p23) (not_at p24) (visited p23)
   goals met: 0 of 4
2. (move p23 p22)
   deleted: (at p23) (not_at p22)
   added: (at p22) (not_at p23) (visited p22)
   goals met: 0 of 4
3. (eat p22)
   deleted: (hasfood p22)
   added: (carryingfood) (nofood p22)
   goals met: 1 of 4
4. (move p22 p12)
   deleted: (at p22) (not_at p12)
   added: (at p12) (not_at p22) (visited p12)
   goals met: 1 of 4
5. (eat p12)
   deleted: (hasfood p12)
   added: (nofood p12)
   goals met: 2 of 4
6. (move p12 p11)
   deleted: (at p12) (not_at p11)
   added: (at p11) (not_at p12) (visited p11)
   goals met: 2 of 4
7. (eat p11)
   deleted: (hasfood p11)
   added: (nofood p11)
   goals met: 3 of 4
8. (move p11 p21)
   deleted: (at p11) (not_at p21)
   added: (at p21) (not_at p11) (visited p21)
   goals met: 3 of 4
9. (move p21 p20)
   deleted: (at p21) (not_at p20)
   added: (at p20) (not_at p21) (visited p20)
   goals met: 3 of 4
10. (eat p20)
   deleted: (hasfood p20)
   added: (nofood p20)
   goals met: 4 of 4
